c5/src/InformationRegisters/Holidays/Holidays.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Holidays</name>
  <resources>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Reference</name>
    <type>
      <types>CatalogRef.Holidays</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Day</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/Week/Week.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Week</name>
  <enumValues>
    <name>Monday</name>
  </enumValues>
  <enumValues>
    <name>Tuesday</name>
  </enumValues>
  <enumValues>
    <name>Wednesday</name>
  </enumValues>
  <enumValues>
    <name>Thursday</name>
  </enumValues>
  <enumValues>
    <name>Friday</name>
  </enumValues>
  <enumValues>
    <name>Saturday</name>
  </enumValues>
  <enumValues>
    <name>Sunday</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Schedules/Schedules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Schedules</name>
  <attributes>
    <name>AverageDays</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DayOff1</name>
    <type>
      <types>EnumRef.Week</types>
    </type>
  </attributes>
  <attributes>
    <name>DayOff2</name>
    <type>
      <types>EnumRef.Week</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysOffCoef</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Holidays</name>
    <type>
      <types>CatalogRef.Holidays</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OvertimeCoef1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OvertimeCoef2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OvertimeLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimesheetDays</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimesheetPeriod</name>
    <type>
      <types>EnumRef.TimesheetPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>UseOvertime</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WeekStart</name>
    <type>
      <types>EnumRef.Week</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Years</name>
    <attributes>
      <name>Friday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FridayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FridayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManualChanges</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Monday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MondayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MondayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Saturday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SaturdayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SaturdayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sunday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SundayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SundayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Thursday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ThursdayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ThursdayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Tuesday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TuesdayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TuesdayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Wednesday</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WednesdayEvening</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WednesdayNight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Year</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/Diary/Module.bsl
Function GetWeekInfo ( val Schedule ) export
	
	s = "
	|select Schedules.Start as Start, Schedules.Finish as Finish,
	|	case when Schedules.DayOff1 = value ( Enum.Week.Monday ) then 1
	|		when Schedules.DayOff1 = value ( Enum.Week.Tuesday ) then 2
	|		when Schedules.DayOff1 = value ( Enum.Week.Wednesday ) then 3
	|		when Schedules.DayOff1 = value ( Enum.Week.Thursday ) then 4
	|		when Schedules.DayOff1 = value ( Enum.Week.Friday ) then 5
	|		when Schedules.DayOff1 = value ( Enum.Week.Saturday ) then 6
	|		when Schedules.DayOff1 = value ( Enum.Week.Sunday ) then 7
	|		else 0
	|	end as DayOff1,
	|	case when Schedules.DayOff2 = value ( Enum.Week.Monday ) then 1
	|		when Schedules.DayOff2 = value ( Enum.Week.Tuesday ) then 2
	|		when Schedules.DayOff2 = value ( Enum.Week.Wednesday ) then 3
	|		when Schedules.DayOff2 = value ( Enum.Week.Thursday ) then 4
	|		when Schedules.DayOff2 = value ( Enum.Week.Friday ) then 5
	|		when Schedules.DayOff2 = value ( Enum.Week.Saturday ) then 6
	|		when Schedules.DayOff2 = value ( Enum.Week.Sunday ) then 7
	|		else 0
	|	end as DayOff2,
	|	case when Schedules.WeekStart = value ( Enum.Week.Monday ) then 1
	|		when Schedules.WeekStart = value ( Enum.Week.Tuesday ) then 2
	|		when Schedules.WeekStart = value ( Enum.Week.Wednesday ) then 3
	|		when Schedules.WeekStart = value ( Enum.Week.Thursday ) then 4
	|		when Schedules.WeekStart = value ( Enum.Week.Friday ) then 5
	|		when Schedules.WeekStart = value ( Enum.Week.Saturday ) then 6
	|		when Schedules.WeekStart = value ( Enum.Week.Sunday ) then 7
	|	end as WeekStart
	|from Catalog.Schedules as Schedules
	|where Schedules.Ref = &Schedule
	|";
	q = new Query ( s );
	q.SetParameter ( "Schedule", Schedule );
	return Conversion.RowToStructure ( q.Execute ().Unload () );
	
EndFunction 

Procedure SqlHolidays ( Env ) export
	
	s = "
	|// #Holidays
	|select List.Day as Day
	|from InformationRegister.Holidays as List
	|	//
	|	// Schedules
	|	//
	|	join Catalog.Schedules as Schedules
	|	on Schedules.Ref = &Schedule
	|	and Schedules.Holidays = List.Reference
	|where List.Day between &DateStart and &DateEnd
	|";
	Env.Selection.Add ( s );
	
EndProcedure 

Function ConvertTotalsByDaysToMap ( Env ) export
	
	totals = new Map ();
	for each row in Env.TotalsByDays do
		totals [ row.Date ] = row.Minutes;
	enddo; 
	return totals;
	
EndFunction

Function ConvertHolidaysToMap ( Env ) export
	
	holidays = new Map ();
	for each row in Env.Holidays do
		holidays [ row.Day ] = true;
	enddo; 
	return holidays;
	
EndFunction 

Function ColorsMap ( Env ) export
	
	set = new Map ();
	for each row in Env.CalendarAppearance do
		set [ row.Code ] = new Structure ( "Color, BackColor", Colors.Deserialize ( row.Color ), Colors.Deserialize ( row.BackColor ) );
	enddo;
	return set;
	
EndFunction
